# Codealong 2 | Introduction to `pandas`

## Importing `pandas` (and `NumPy`) into the environment

Most (if not all) of the course notebooks will start by importing `pandas` into the environment.  Because much of `pandas` is built on `NumPy`, `NumPy` is also imported alongside.

We will use a widely used convention by importing `pandas` and referencing it with a `pd.` prefix.  Likewise, `NumPy` is imported and referenced with a `np.` namespace.

In [1]:
import os
import numpy as np
import pandas as pd

pd.set_option('display.max_rows', 6)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 10)

## Loading data from files and the Web

`pandas` provides powerful facilities for easy retrieval of data from a variety of data sources.  In particular, it provides built-in support for loading data in `.csv` format, a common means of storing structured data in text files.

In [3]:
df = pd.read_csv(os.path.join('zillow-02-starter.csv'))

In [4]:
type(df)

pandas.core.frame.DataFrame

In [5]:
df

,ID,Address,Latitude,Longitude,DateOfSale,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
0,15063471,"55 Vandewater St APT 9, San Francisco, CA",37805103,-122412856,12/4/15,...,550.0,sqft,NaN,NaN,1980.0
1,15063505,"740 Francisco St, San Francisco, CA",37804420,-122417389,11/30/15,...,1430.0,sqft,2435.0,sqft,1948.0
2,15063609,"819 Francisco St, San Francisco, CA",37803728,-122419055,11/12/15,...,2040.0,sqft,3920.0,sqft,1976.0
...,...,...,...,...,...,...,...,...,...,...,...
997,2128308939,"33 Santa Cruz Ave, San Francisco, CA",37709136,-122465332,12/10/15,...,1738.0,sqft,2299.0,sqft,1976.0
998,2131957929,"1821 Grant Ave, San Francisco, CA",37803760,-122408531,12/15/15,...,1048.0,sqft,NaN,NaN,1975.0
999,2136213970,"1200 Gough St, San Francisco, CA",37784770,-122424100,1/10/16,...,900.0,sqft,NaN,NaN,1966.0

## Selecting columns of a `DataFrame`

Selecting data in specific columns of a `DataFrame` is performed by using the `[]` operator.

Passing a single integer, or a list of integers, to `[]` will perform a location based lookup of the columns.

E.g., columns 5 and 6:

In [6]:
df[ [5, 6] ]

     SalePrice SalePriceUnit
0    710000.00             $
1         2.15            $M
2         5.60            $M
..         ...           ...
997  830000.00             $
998  835000.00             $
999  825000.00             $

[1000 rows x 2 columns]

In [7]:
type(df[ [5, 6] ])

pandas.core.frame.DataFrame

The list can contain a single integer.

E.g., column 7 only:

In [8]:
df[ [7] ]

    IsAStudio
0       False
1       False
2       False
..        ...
997     False
998     False
999     False

[1000 rows x 1 columns]

In [9]:
type(df[ [7] ])

pandas.core.frame.DataFrame

If the values passed to `[]` are non-integers, the `DataFrame` will attempt to match them to those in the `columns` index.

In [10]:
df.columns

Index([u'ID', u'Address', u'Latitude', u'Longitude', u'DateOfSale',
       u'SalePrice', u'SalePriceUnit', u'IsAStudio', u'BedCount', u'BathCount',
       u'Size', u'SizeUnit', u'LotSize', u'LotSizeUnit', u'BuiltInYear'],
      dtype='object')

In [11]:
df[ ['SalePrice', 'SalePriceUnit'] ]

     SalePrice SalePriceUnit
0    710000.00             $
1         2.15            $M
2         5.60            $M
..         ...           ...
997  830000.00             $
998  835000.00             $
999  825000.00             $

[1000 rows x 2 columns]

However, you cannot mix integers and non-integers.

In [12]:
df[ ['SalePrice', 6] ]

KeyError: '[6] not in index'

Not passing a list always results in a value based lookup of the column:

In [13]:
df['Address']

0      55 Vandewater St APT 9, San Francisco, CA
1            740 Francisco St, San Francisco, CA
2            819 Francisco St, San Francisco, CA
                         ...
997         33 Santa Cruz Ave, San Francisco, CA
998            1821 Grant Ave, San Francisco, CA
999             1200 Gough St, San Francisco, CA
Name: Address, dtype: object

And the result is a `Series`:

In [14]:
type(df['Address'])

pandas.core.series.Series

Columns can also be retrieved using "attribute access" as `DataFrames` adds a property for each column with the names of the properties as the names of the columns.  Note that this will not work for columns that have spaces or dots in their name.

In [15]:
df.Address

0      55 Vandewater St APT 9, San Francisco, CA
1            740 Francisco St, San Francisco, CA
2            819 Francisco St, San Francisco, CA
                         ...
997         33 Santa Cruz Ave, San Francisco, CA
998            1821 Grant Ave, San Francisco, CA
999             1200 Gough St, San Francisco, CA
Name: Address, dtype: object

The columns index again...

In [16]:
df.columns

Index([u'ID', u'Address', u'Latitude', u'Longitude', u'DateOfSale',
       u'SalePrice', u'SalePriceUnit', u'IsAStudio', u'BedCount', u'BathCount',
       u'Size', u'SizeUnit', u'LotSize', u'LotSizeUnit', u'BuiltInYear'],
      dtype='object')

To find the zero-based location of a column, use the `.get_loc()` method of the `columns` index.  E.g.,

In [17]:
df.columns.get_loc('BedCount')

8

In [18]:
df[ [df.columns.get_loc('BedCount')] ]

     BedCount
0         1.0
1         NaN
2         2.0
..        ...
997       3.0
998       2.0
999       1.0

[1000 rows x 1 columns]

In [19]:
df[ ['BedCount'] ]

     BedCount
0         1.0
1         NaN
2         2.0
..        ...
997       3.0
998       2.0
999       1.0

[1000 rows x 1 columns]

## Selecting rows and values of a `DataFrame` using the index

### Slicing using the `[]` operator

E.g., first five rows:

In [20]:
df[:5]

,ID,Address,Latitude,Longitude,DateOfSale,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
0,15063471,"55 Vandewater St APT 9, San Francisco, CA",37805103,-122412856,12/4/15,...,550.0,sqft,NaN,NaN,1980.0
1,15063505,"740 Francisco St, San Francisco, CA",37804420,-122417389,11/30/15,...,1430.0,sqft,2435.0,sqft,1948.0
2,15063609,"819 Francisco St, San Francisco, CA",37803728,-122419055,11/12/15,...,2040.0,sqft,3920.0,sqft,1976.0
3,15064044,"199 Chestnut St APT 5, San Francisco, CA",37804392,-122406590,12/11/15,...,1060.0,sqft,NaN,NaN,1930.0
4,15064257,"111 Chestnut St APT 403, San Francisco, CA",37804240,-122405509,1/15/16,...,1299.0,sqft,NaN,NaN,1993.0

## Selecting rows by index label and location: `.loc[]` and `.iloc[]`

Until now, the index of the `DataFrame` is a numerical starting from 0 but you can specify which column(s) should be in the index.  E.g., `ID`:

In [21]:
df = df.set_index('ID')

In [22]:
df

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
15063471,"55 Vandewater St APT 9, San Francisco, CA",37805103,-122412856,12/4/15,710000.00,...,550.0,sqft,NaN,NaN,1980.0
15063505,"740 Francisco St, San Francisco, CA",37804420,-122417389,11/30/15,2.15,...,1430.0,sqft,2435.0,sqft,1948.0
15063609,"819 Francisco St, San Francisco, CA",37803728,-122419055,11/12/15,5.60,...,2040.0,sqft,3920.0,sqft,1976.0
...,...,...,...,...,...,...,...,...,...,...,...
2128308939,"33 Santa Cruz Ave, San Francisco, CA",37709136,-122465332,12/10/15,830000.00,...,1738.0,sqft,2299.0,sqft,1976.0
2131957929,"1821 Grant Ave, San Francisco, CA",37803760,-122408531,12/15/15,835000.00,...,1048.0,sqft,NaN,NaN,1975.0
2136213970,"1200 Gough St, San Francisco, CA",37784770,-122424100,1/10/16,825000.00,...,900.0,sqft,NaN,NaN,1966.0

E.g., row with index 15063505:

In [23]:
df.loc[15063505]

Address        740 Francisco St, San Francisco, CA
Latitude                                  37804420
Longitude                               -122417389
                              ...
LotSize                                       2435
LotSizeUnit                                   sqft
BuiltInYear                                   1948
Name: 15063505, dtype: object

E.g., rows with indices 15063505 and 15064044:

In [24]:
df.loc[ [15063505, 15064044] ]

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
15063505,"740 Francisco St, San Francisco, CA",37804420,-122417389,11/30/15,2.15,...,1430.0,sqft,2435.0,sqft,1948.0
15064044,"199 Chestnut St APT 5, San Francisco, CA",37804392,-122406590,12/11/15,1.50,...,1060.0,sqft,NaN,NaN,1930.0

E.g., rows 1 and 3:

In [25]:
df.iloc[ [1, 3] ]

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
15063505,"740 Francisco St, San Francisco, CA",37804420,-122417389,11/30/15,2.15,...,1430.0,sqft,2435.0,sqft,1948.0
15064044,"199 Chestnut St APT 5, San Francisco, CA",37804392,-122406590,12/11/15,1.50,...,1060.0,sqft,NaN,NaN,1930.0

## Scalar lookup by label or location using `.at[]` and `.iat[]`

Scalar values can be looked up by label using .at, by passing both the row label and then the column name/value.  E.g.,

In [26]:
df.at[15064044, 'DateOfSale']

'12/11/15'

Scalar values can also be looked up by location using .iat by passing both the row location and then the column location. E.g.,

In [27]:
df.iat[3, 3]

'12/11/15'

## Selecting rows of a `DataFrame` by Boolean selection

Rows can also be selected by using Boolean selection, using an array calculated from the result of applying a logical condition on the values in any of the columns.  This
allows us to build more complicated selections than those based simply upon index labels or positions.

E.g., what homes have been built before 1900?

In [28]:
df.BuiltInYear < 1900

ID
15063471      False
15063505      False
15063609      False
              ...
2128308939    False
2131957929    False
2136213970    False
Name: BuiltInYear, dtype: bool

This results in a `Series` that can be used to select the rows where the value is True:

In [29]:
df[ df.BuiltInYear < 1900 ]

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
15065140,"1407 Montgomery St APT 2, San Francisco, CA",37802299,-122404941,1/28/16,976000.00,...,1000.0,sqft,NaN,NaN,1870.0
15076156,"1533 Sutter St, San Francisco, CA",37786658,-122426481,11/12/15,5.53,...,7375.0,sqft,2748.0,sqft,1890.0
15078536,"640 Steiner St, San Francisco, CA",37775399,-122432491,12/15/15,1.50,...,1593.0,sqft,NaN,NaN,1895.0
...,...,...,...,...,...,...,...,...,...,...,...
123597223,"1954 Golden Gate Ave, San Francisco, CA",37778246,-122442763,11/24/15,1.10,...,1275.0,sqft,NaN,NaN,1895.0
123597388,"667 Shotwell St # A, San Francisco, CA",37757851,-122415629,2/10/16,775000.00,...,1212.0,sqft,NaN,NaN,1890.0
2122992200,"129 Octavia St, San Francisco, CA",37773192,-122424037,11/20/15,2.75,...,3655.0,sqft,NaN,NaN,1883.0

Multiple conditions can be put together.  E.g.,

In [30]:
df[ (df.BuiltInYear < 1900) & (df.Size > 1500) ]

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
15076156,"1533 Sutter St, San Francisco, CA",37786658,-122426481,11/12/15,5.53,...,7375.0,sqft,2748.0,sqft,1890.0
15078536,"640 Steiner St, San Francisco, CA",37775399,-122432491,12/15/15,1.50,...,1593.0,sqft,NaN,NaN,1895.0
15078866,"753-755 Oak St, San Francisco, CA",37773576,-122431663,11/10/15,375000.00,...,2430.0,sqft,3781.0,sqft,1890.0
...,...,...,...,...,...,...,...,...,...,...,...
82785514,"1394 Mcallister St, San Francisco, CA",37778463,-122434933,11/13/15,2.10,...,2300.0,sqft,NaN,NaN,1890.0
119684777,"967 Hayes St, San Francisco, CA",37775645,-122432222,12/17/15,1.95,...,3006.0,sqft,NaN,NaN,1885.0
2122992200,"129 Octavia St, San Francisco, CA",37773192,-122424037,11/20/15,2.75,...,3655.0,sqft,NaN,NaN,1883.0

At the same time, it is possible to select a subset of the columns.  E.g.,

In [31]:
df[ (df.BuiltInYear < 1900) & (df.Size > 1500) ][ ['Address'] ]

                                          Address
ID
15076156        1533 Sutter St, San Francisco, CA
15078536        640 Steiner St, San Francisco, CA
15078866        753-755 Oak St, San Francisco, CA
...                                           ...
82785514    1394 Mcallister St, San Francisco, CA
119684777         967 Hayes St, San Francisco, CA
2122992200      129 Octavia St, San Francisco, CA

[9 rows x 1 columns]

In [ ]:

+